piborisovich/microcontrollers/Milandr/Libraries/SPL/MDR32F2xQI/src/MDR32F2xQI_timer.c
/**
 *******************************************************************************
 * @file    MDR32F2xQI_timer.c
 * @author  Milandr Application Team
 * @version V1.0.0
 * @date    24/05/2023
 * @brief   This file contains all the TIMER firmware functions.
 *******************************************************************************
 * <br><br>
 *
 * THE PRESENT FIRMWARE IS FOR GUIDANCE ONLY. IT AIMS AT PROVIDING CUSTOMERS
 * WITH CODING INFORMATION REGARDING MILANDR'S PRODUCTS IN ORDER TO FACILITATE
 * THE USE AND SAVE TIME. MILANDR SHALL NOT BE HELD LIABLE FOR ANY
 * DIRECT, INDIRECT OR CONSEQUENTIAL DAMAGES RESULTING
 * FROM THE CONTENT OF SUCH FIRMWARE AND/OR A USE MADE BY CUSTOMERS OF THE
 * CODING INFORMATION CONTAINED HEREIN IN THEIR PRODUCTS.
 *
 * <h2><center>&copy; COPYRIGHT 2025 Milandr</center></h2>
 *******************************************************************************
 */

/* Includes ------------------------------------------------------------------*/
#include "MDR32F2xQI_timer.h"

/** @addtogroup __MDR32F2xQI_StdPeriph_Driver MDR32F2xQI Standard Peripherial Driver
 * @{
 */

/** @addtogroup TIMER TIMER
 * @{
 */

/** @defgroup TIMER_Private_Defines TIMER Private Defines
 * @{
 */

#define IS_TIMER_ALL_PERIPH(PERIPH) (((PERIPH) == MDR_TIMER0) || \
                                     ((PERIPH) == MDR_TIMER1))

/** @} */ /* End of group TIMER_Private_Defines */

/** @addtogroup TIMER_Exported_Functions TIMER Exported Functions
 * @{
 */

/**
 * @brief  Deinitializes the TIMERx peripheral registers to their default reset values.
 * @param  TIMERx: select the TIMER peripheral.
 *         This parameter can be one of the following values: MDR_TIMER0, MDR_TIMER1.
 * @retval None.
 */
void TIMER_DeInit(MDR_TIMER_TypeDef* TIMERx)
{
    /* Check the parameter */
    assert_param(IS_TIMER_ALL_PERIPH(TIMERx));

    TIMERx->CNTRL = 0;
    TIMERx->CNT   = 0;
    TIMERx->PSG   = 0;
    TIMERx->ARR   = 0;

    TIMERx->CH1_CNTRL  = 0;
    TIMERx->CH1_CNTRL1 = 0;
    TIMERx->CH1_CNTRL2 = 0;
    TIMERx->CH1_DTG    = 0;

    TIMERx->CCR1  = 0;
    TIMERx->CCR11 = 0;

    TIMERx->BRKETR_CNTRL = 0;
    TIMERx->STATUS       = 0;
    TIMERx->IE           = 0;
#if defined(USE_MDR32F21QI)
    TIMERx->CH2_CNTRL  = 0;
    TIMERx->CH3_CNTRL  = 0;
    TIMERx->CH4_CNTRL  = 0;
    TIMERx->CH2_CNTRL1 = 0;
    TIMERx->CH3_CNTRL1 = 0;
    TIMERx->CH4_CNTRL1 = 0;
    TIMERx->CH2_CNTRL2 = 0;
    TIMERx->CH3_CNTRL2 = 0;
    TIMERx->CH4_CNTRL2 = 0;
    TIMERx->CH2_DTG    = 0;
    TIMERx->CH3_DTG    = 0;
    TIMERx->CH4_DTG    = 0;

    TIMERx->CCR2 = 0;
    TIMERx->CCR3 = 0;
    TIMERx->CCR4 = 0;

    TIMERx->CCR21 = 0;
    TIMERx->CCR31 = 0;
    TIMERx->CCR41 = 0;

    TIMERx->DMA_RE = 0;
#endif
}

/**
 * @brief  Initializes the TIMERx Counter peripheral according to
 *         the specified parameters in the TIMER_CntInitStruct.
 * @param  TIMERx: select the TIMER peripheral.
 *         This parameter can be one of the following values: MDR_TIMER0, MDR_TIMER1.
 * @param  TIMER_CntInitStruct: pointer to a @ref TIMER_CNT_InitTypeDef structure
 *         that contains the configuration information for the specified TIMER Counter peripheral.
 * @retval None.
 */
void TIMER_CNT_Init(MDR_TIMER_TypeDef* TIMERx, const TIMER_CNT_InitTypeDef* TIMER_CntInitStruct)
{
    uint32_t TmpRegCNTRL;
    uint32_t TmpRegBRKETR_CNTRL;

    /* Check the parameters */
    assert_param(IS_TIMER_ALL_PERIPH(TIMERx));
    assert_param(IS_TIMER_COUNTER_EVENT_SOURCE(TIMER_CntInitStruct->TIMER_CounterEventSource));
    assert_param(IS_TIMER_COUNTER_MODE(TIMER_CntInitStruct->TIMER_CounterMode));
    assert_param(IS_TIMER_COUNTER_DIR(TIMER_CntInitStruct->TIMER_CounterDirection));
    assert_param(IS_TIMER_FDTS_PRESCALER(TIMER_CntInitStruct->TIMER_FDTS_Prescaler));
    assert_param(IS_TIMER_ARR_UPDATE_MODE(TIMER_CntInitStruct->TIMER_ARR_UpdateMode));
    assert_param(IS_TIMER_ETR_FILTER(TIMER_CntInitStruct->TIMER_ETR_Filter));
    assert_param(IS_TIMER_ETR_PRESCALER(TIMER_CntInitStruct->TIMER_ETR_Prescaler));
    assert_param(IS_TIMER_ETR_POLARITY(TIMER_CntInitStruct->TIMER_ETR_Polarity));
    assert_param(IS_TIMER_BRK_POLARITY(TIMER_CntInitStruct->TIMER_BRK_Polarity));

    TIMERx->CNT = TIMER_CntInitStruct->TIMER_CounterValue;
    TIMERx->PSG = TIMER_CntInitStruct->TIMER_CounterPrescaler;
    TIMERx->ARR = TIMER_CntInitStruct->TIMER_CounterPeriod;

    /* Form new value for the CNTRL register */
    TmpRegCNTRL = (uint32_t)TIMER_CntInitStruct->TIMER_CounterEventSource |
                  (uint32_t)TIMER_CntInitStruct->TIMER_CounterMode |
                  (uint32_t)TIMER_CntInitStruct->TIMER_CounterDirection |
                  (uint32_t)TIMER_CntInitStruct->TIMER_FDTS_Prescaler |
                  (uint32_t)TIMER_CntInitStruct->TIMER_ARR_UpdateMode;

    /* Configure CNTRL register with new value */
    TIMERx->CNTRL = TmpRegCNTRL;

    /* Form new value for the BRKETR_CNTRL register */
    TmpRegBRKETR_CNTRL = (uint32_t)TIMER_CntInitStruct->TIMER_ETR_Filter |
                         (uint32_t)TIMER_CntInitStruct->TIMER_ETR_Prescaler |
                         (uint32_t)TIMER_CntInitStruct->TIMER_ETR_Polarity |
                         (uint32_t)TIMER_CntInitStruct->TIMER_BRK_Polarity;

    /* Configure BRKETR_CNTRL register with new value */
    TIMERx->BRKETR_CNTRL = TmpRegBRKETR_CNTRL;
}

/**
 * @brief  Fills each TIMER_CntInitStruct member with its default value.
 * @param  TIMER_CntInitStruct: pointer to a @ref TIMER_CNT_InitTypeDef structure
 *         which will be initialized.
 * @retval None.
 */
void TIMER_CNT_StructInit(TIMER_CNT_InitTypeDef* TIMER_CntInitStruct)
{
    TIMER_CntInitStruct->TIMER_CounterValue       = 0;
    TIMER_CntInitStruct->TIMER_CounterPrescaler   = 0;
    TIMER_CntInitStruct->TIMER_CounterPeriod      = 0;
    TIMER_CntInitStruct->TIMER_CounterEventSource = TIMER_CNT_EVNT_SRC_TIM_CLK;
    TIMER_CntInitStruct->TIMER_CounterMode        = TIMER_CNT_MODE_CLK_FIXED_DIR;
    TIMER_CntInitStruct->TIMER_CounterDirection   = TIMER_CNT_DIR_UP;
    TIMER_CntInitStruct->TIMER_FDTS_Prescaler     = TIMER_FDTS_PRESCALER_DIV_1;
    TIMER_CntInitStruct->TIMER_ARR_UpdateMode     = TIMER_ARR_UPD_IMMEDIATELY;
    TIMER_CntInitStruct->TIMER_ETR_Filter         = TIMER_ETR_FILTER_1FF_AT_FDTS;
    TIMER_CntInitStruct->TIMER_ETR_Prescaler      = TIMER_ETR_PRESCALER_DIV_1;
    TIMER_CntInitStruct->TIMER_ETR_Polarity       = TIMER_ETR_POLARITY_NON_INV;
    TIMER_CntInitStruct->TIMER_BRK_Polarity       = TIMER_BRK_POLARITY_NON_INV;
}

/**
 * @brief  Enables or disables the specified TIMERx Counter peripheral.
 * @param  TIMERx: select the TIMER peripheral.
 *         This parameter can be one of the following values: MDR_TIMER0, MDR_TIMER1.
 * @param  NewState - @ref FunctionalState - new state of the TIMER Counter peripheral.
 * @retval None.
 */
void TIMER_CNT_Cmd(MDR_TIMER_TypeDef* TIMERx, FunctionalState NewState)
{
    /* Check the parameters */
    assert_param(IS_TIMER_ALL_PERIPH(TIMERx));
    assert_param(IS_FUNCTIONAL_STATE(NewState));

    /* Form new value */
    if (NewState != DISABLE) {
        /* Enable TIMERx Counter by setting the CNT_EN bit in the CNTRL register */
        TIMERx->CNTRL |= TIMER_CNTRL_CNT_EN;
    } else {
        /* Disable TIMERx Counter by clearing the CNT_EN bit in the CNTRL register */
        TIMERx->CNTRL &= ~TIMER_CNTRL_CNT_EN;
    }
}

/**
 * @brief  Sets the TIMERx Counter Register value.
 * @param  TIMERx: select the TIMER peripheral.
 *         This parameter can be one of the following values: MDR_TIMER0, MDR_TIMER1.
 * @param  Counter: specifies the Counter register new value.
 * @retval None.
 */
void TIMER_CNT_SetCounter(MDR_TIMER_TypeDef* TIMERx, uint16_t Counter)
{
    /* Check the parameter */
    assert_param(IS_TIMER_ALL_PERIPH(TIMERx));

    TIMERx->CNT = Counter;
}

/**
 * @brief  Returns the TIMERx Counter Register value.
 * @param  TIMERx: select the TIMER peripheral.
 *         This parameter can be one of the following values: MDR_TIMER0, MDR_TIMER1.
 * @retval Counter Register value.
 */
uint16_t TIMER_CNT_GetCounter(MDR_TIMER_TypeDef* TIMERx)
{
    /* Check the parameter */
    assert_param(IS_TIMER_ALL_PERIPH(TIMERx));

