piborisovich/microcontrollers/Milandr/Libraries/SPL/MDR32F2xQI/src/MDR32F2xQI_timer.c
    return (uint16_t)TIMERx->CNT;
}

/**
 * @brief  Sets the TIMERx TIM_CLK Prescaler Register value.
 * @param  TIMERx: select the TIMER peripheral.
 *         This parameter can be one of the following values: MDR_TIMER0, MDR_TIMER1.
 * @param  Prescaler: specifies the TIM_CLK Prescaler Register value.
 * @retval None.
 */
void TIMER_CNT_SetPrescaler(MDR_TIMER_TypeDef* TIMERx, uint16_t Prescaler)
{
    /* Check the parameter */
    assert_param(IS_TIMER_ALL_PERIPH(TIMERx));

    TIMERx->PSG = Prescaler;
}

/**
 * @brief  Returns the TIMERx TIM_CLK Prescaler Register value.
 * @param  TIMERx: select the TIMER peripheral.
 *         This parameter can be one of the following values: MDR_TIMER0, MDR_TIMER1.
 * @retval TIM_CLK Prescaler Register value.
 */
uint16_t TIMER_CNT_GetPrescaler(MDR_TIMER_TypeDef* TIMERx)
{
    /* Check the parameter */
    assert_param(IS_TIMER_ALL_PERIPH(TIMERx));

    return (uint16_t)TIMERx->PSG;
}

/**
 * @brief  Sets the TIMERx Autoreload Register (ARR) Update mode.
 * @param  TIMERx: select the TIMER peripheral.
 *         This parameter can be one of the following values: MDR_TIMER0, MDR_TIMER1.
 * @param  UpdateMode - @ref TIMER_ARR_UpdateMode_TypeDef - specifies the Autoreload Register Update mode.
 * @retval None.
 */
void TIMER_CNT_SetAutoreloadUpdateMode(MDR_TIMER_TypeDef* TIMERx, TIMER_ARR_UpdateMode_TypeDef UpdateMode)
{
    uint32_t TmpRegCNTRL;

    /* Check the parameters */
    assert_param(IS_TIMER_ALL_PERIPH(TIMERx));
    assert_param(IS_TIMER_ARR_UPDATE_MODE(UpdateMode));

    TmpRegCNTRL = TIMERx->CNTRL;
    TmpRegCNTRL &= ~TIMER_CNTRL_ARRB_EN_Msk;
    TmpRegCNTRL |= (uint32_t)UpdateMode;
    TIMERx->CNTRL = TmpRegCNTRL;
}

/**
 * @brief  Sets the TIMERx Autoreload Register value.
 * @param  TIMERx: select the TIMER peripheral.
 *         This parameter can be one of the following values: MDR_TIMER0, MDR_TIMER1.
 * @param  Autoreload: specifies the Autoreload Register value.
 * @retval None.
 */
void TIMER_CNT_SetAutoreload(MDR_TIMER_TypeDef* TIMERx, uint16_t Autoreload)
{
    /* Check the parameter */
    assert_param(IS_TIMER_ALL_PERIPH(TIMERx));

    TIMERx->ARR = Autoreload;
}

/**
 * @brief  Returns the TIMERx Autoreload Register value.
 * @param  TIMERx: select the TIMER peripheral.
 *         This parameter can be one of the following values: MDR_TIMER0, MDR_TIMER1.
 * @retval Autoreload Register value.
 */
uint16_t TIMER_CNT_GetAutoreload(MDR_TIMER_TypeDef* TIMERx)
{
    /* Check the parameter */
    assert_param(IS_TIMER_ALL_PERIPH(TIMERx));

    return (uint16_t)TIMERx->ARR;
}

/**
 * @brief  Configures the TIMERx FDTS Prescaler.
 * @param  TIMERx: select the TIMER peripheral.
 *         This parameter can be one of the following values: MDR_TIMER0, MDR_TIMER1.
 * @param  Prescaler - @ref TIMER_FDTS_Prescaler_TypeDef - specifies the FDTS Prescaler.
 * @retval None.
 */
void TIMER_FDTS_SetPrescaler(MDR_TIMER_TypeDef* TIMERx, TIMER_FDTS_Prescaler_TypeDef Prescaler)
{
    uint32_t TmpRegCNTRL;

    /* Check the parameters */
    assert_param(IS_TIMER_ALL_PERIPH(TIMERx));
    assert_param(IS_TIMER_FDTS_PRESCALER(Prescaler));

    TmpRegCNTRL = TIMERx->CNTRL;
    TmpRegCNTRL &= ~TIMER_CNTRL_FDTS_Msk;
    TmpRegCNTRL |= (uint32_t)Prescaler;

    TIMERx->CNTRL = TmpRegCNTRL;
}

/**
 * @brief  Configures the TIMERx Counter Event source.
 * @param  TIMERx: select the TIMER peripheral.
 *         This parameter can be one of the following values: MDR_TIMER0, MDR_TIMER1.
 * @param  CounterEventSource - @ref TIMER_CNT_EventSource_TypeDef - specifies the Event source.
 * @retval None.
 */
void TIMER_CNT_EventSourceConfig(MDR_TIMER_TypeDef* TIMERx, TIMER_CNT_EventSource_TypeDef CounterEventSource)
{
    uint32_t TmpRegCNTRL;

    /* Check the parameters */
    assert_param(IS_TIMER_ALL_PERIPH(TIMERx));
    assert_param(IS_TIMER_COUNTER_EVENT_SOURCE(CounterEventSource));

    TmpRegCNTRL = TIMERx->CNTRL;
    TmpRegCNTRL &= ~TIMER_CNTRL_EVENT_SEL_Msk;
    TmpRegCNTRL |= (uint32_t)CounterEventSource;
    TIMERx->CNTRL = TmpRegCNTRL;
}

/**
 * @brief  Configures the TIMERx count mode.
 * @param  TIMERx: select the TIMER peripheral.
 *         This parameter can be one of the following values: MDR_TIMER0, MDR_TIMER1.
 * @param  Mode - @ref TIMER_CNT_Mode_TypeDef - specifies the TIMER count mode.
 * @retval None.
 */
void TIMER_CNT_ModeConfig(MDR_TIMER_TypeDef* TIMERx, TIMER_CNT_Mode_TypeDef Mode)
{
    uint32_t TmpRegCNTRL;

    /* Check the parameters */
    assert_param(IS_TIMER_ALL_PERIPH(TIMERx));
    assert_param(IS_TIMER_COUNTER_MODE(Mode));

    TmpRegCNTRL = TIMERx->CNTRL;
    TmpRegCNTRL &= ~TIMER_CNTRL_CNT_MODE_Msk;
    TmpRegCNTRL |= (uint32_t)Mode;
    TIMERx->CNTRL = TmpRegCNTRL;
}

/**
 * @brief  Configures the TIMERx Counter direction.
 * @param  TIMERx: select the TIMER peripheral.
 *         This parameter can be one of the following values: MDR_TIMER0, MDR_TIMER1.
 * @param  Direction - @ref TIMER_CNT_Dir_TypeDef - specifies the TIMER Counter direction.
 * @retval None.
 */
void TIMER_CNT_SetDirection(MDR_TIMER_TypeDef* TIMERx, TIMER_CNT_Dir_TypeDef Direction)
{
    uint32_t TmpRegCNTRL;

    /* Check the parameters */
    assert_param(IS_TIMER_ALL_PERIPH(TIMERx));
    assert_param(IS_TIMER_COUNTER_DIR(Direction));

    TmpRegCNTRL = TIMERx->CNTRL;
    TmpRegCNTRL &= ~TIMER_CNTRL_DIR_Msk;
    TmpRegCNTRL |= (uint32_t)Direction;
    TIMERx->CNTRL = TmpRegCNTRL;
}

/**
 * @brief  Returns the TIMERx Counter direction.
 * @param  TIMERx: select the TIMER peripheral.
 *         This parameter can be one of the following values: MDR_TIMER0, MDR_TIMER1.
 * @retval @ref TIMER_CNT_Dir_TypeDef - The current TIMER Counter direction.
 */
TIMER_CNT_Dir_TypeDef TIMER_CNT_GetDirection(MDR_TIMER_TypeDef* TIMERx)
{
    TIMER_CNT_Dir_TypeDef Status;

    /* Check the parameters */
    assert_param(IS_TIMER_ALL_PERIPH(TIMERx));

    if ((TIMERx->CNTRL & TIMER_CNTRL_DIR_Msk) == 0) {
        Status = TIMER_CNT_DIR_UP;
    } else {
        Status = TIMER_CNT_DIR_DOWN;
    }

