piborisovich/microcontrollers/Milandr/Libraries/SPL/MDR32F2xQI/src/MDR32F2xQI_timer.c
    return Status;
}

/**
 * @brief  Checks whether the TIMERx CNT, PSG or ARR write operation is in progress or not.
 * @param  TIMERx: select the TIMER peripheral.
 *         This parameter can be one of the following values: MDR_TIMER0, MDR_TIMER1.
 * @retval @ref FlagStatus - The WR_CMPL flag current state:
 *             @arg SET:   Write to CNT, PSG or ARR registers in progress.
 *             @arg RESET: Write to CNT, PSG or ARR registers completed.
 */
FlagStatus TIMER_CNT_GetWriteStatus(MDR_TIMER_TypeDef* TIMERx)
{
    FlagStatus Status;

    /* Check the parameters */
    assert_param(IS_TIMER_ALL_PERIPH(TIMERx));

    if ((TIMERx->CNTRL & TIMER_CNTRL_WR_CMPL_Msk) == 0) {
        Status = RESET;
    } else {
        Status = SET;
    }

    return Status;
}

/**
 * @brief  Configures the TIMERx ETR input.
 * @param  TIMERx: select the TIMER peripheral.
 *         This parameter can be one of the following values: MDR_TIMER0, MDR_TIMER1.
 * @param  Prescaler - @ref TIMER_ETR_Prescaler_TypeDef - specifies the ETR signal prescaler value.
 * @param  Polarity - @ref TIMER_ETR_Polarity_TypeDef - enables or disables inversion on ETR input.
 * @param  Filter - @ref TIMER_ETR_Filter_TypeDef - specifies the ETR Filter configuration.
 * @retval None.
 */
void TIMER_ETR_InputConfig(MDR_TIMER_TypeDef* TIMERx, TIMER_ETR_Prescaler_TypeDef Prescaler, TIMER_ETR_Polarity_TypeDef Polarity, TIMER_ETR_Filter_TypeDef Filter)
{
    uint32_t TmpRegBRKETR_CNTRL;

    /* Check the parameters */
    assert_param(IS_TIMER_ALL_PERIPH(TIMERx));
    assert_param(IS_TIMER_ETR_PRESCALER(Prescaler));
    assert_param(IS_TIMER_ETR_POLARITY(Polarity));
    assert_param(IS_TIMER_ETR_FILTER(Filter));

    TmpRegBRKETR_CNTRL = TIMERx->BRKETR_CNTRL;
    TmpRegBRKETR_CNTRL &= ~(TIMER_BRKETR_CNTRL_ETR_FILTER_Msk | TIMER_BRKETR_CNTRL_ETR_PSC_Msk | TIMER_BRKETR_CNTRL_ETR_INV_Msk);
    TmpRegBRKETR_CNTRL |= (uint32_t)Prescaler |
                          (uint32_t)Polarity |
                          (uint32_t)Filter;
    TIMERx->BRKETR_CNTRL = TmpRegBRKETR_CNTRL;
}

/**
 * @brief  Configures the TIMERx ETR Filter peripheral.
 * @param  TIMERx: select the TIMER peripheral.
 *         This parameter can be one of the following values: MDR_TIMER0, MDR_TIMER1.
 * @param  Filter - @ref TIMER_ETR_Filter_TypeDef - specifies the ETR Filter configuration.
 * @retval None.
 */
void TIMER_ETR_FilterConfig(MDR_TIMER_TypeDef* TIMERx, TIMER_ETR_Filter_TypeDef Filter)
{
    uint32_t TmpRegBRKETR_CNTRL;

    /* Check the parameters */
    assert_param(IS_TIMER_ALL_PERIPH(TIMERx));
    assert_param(IS_TIMER_ETR_FILTER(Filter));

    TmpRegBRKETR_CNTRL = TIMERx->BRKETR_CNTRL;
    TmpRegBRKETR_CNTRL &= ~TIMER_BRKETR_CNTRL_ETR_FILTER_Msk;
    TmpRegBRKETR_CNTRL |= (uint32_t)Filter;
    TIMERx->BRKETR_CNTRL = TmpRegBRKETR_CNTRL;
}

/**
 * @brief  Configures the TIMERx ETR signal prescaler value.
 * @param  TIMERx: select the TIMER peripheral.
 *         This parameter can be one of the following values: MDR_TIMER0, MDR_TIMER1.
 * @param  Prescaler - @ref TIMER_ETR_Prescaler_TypeDef - specifies the ETR signal prescaler value.
 * @retval None.
 */
void TIMER_ETR_PrescalerConfig(MDR_TIMER_TypeDef* TIMERx, TIMER_ETR_Prescaler_TypeDef Prescaler)
{
    uint32_t TmpRegBRKETR_CNTRL;

    /* Check the parameters */
    assert_param(IS_TIMER_ALL_PERIPH(TIMERx));
    assert_param(IS_TIMER_ETR_PRESCALER(Prescaler));

    TmpRegBRKETR_CNTRL = TIMERx->BRKETR_CNTRL;
    TmpRegBRKETR_CNTRL &= ~TIMER_BRKETR_CNTRL_ETR_PSC_Msk;
    TmpRegBRKETR_CNTRL |= (uint32_t)Prescaler;
    TIMERx->BRKETR_CNTRL = TmpRegBRKETR_CNTRL;
}

/**
 * @brief  Configures the TIMERx ETR input inversion.
 * @param  TIMERx: select the TIMER peripheral.
 *         This parameter can be one of the following values: MDR_TIMER0, MDR_TIMER1.
 * @param  Polarity - @ref TIMER_ETR_Polarity_TypeDef - enables or disables inversion on ETR input.
 * @retval None.
 */
void TIMER_ETR_PolarityConfig(MDR_TIMER_TypeDef* TIMERx, TIMER_ETR_Polarity_TypeDef Polarity)
{
    uint32_t TmpRegBRKETR_CNTRL;

    /* Check the parameters */
    assert_param(IS_TIMER_ALL_PERIPH(TIMERx));
    assert_param(IS_TIMER_ETR_POLARITY(Polarity));

    TmpRegBRKETR_CNTRL = TIMERx->BRKETR_CNTRL;
    TmpRegBRKETR_CNTRL &= ~TIMER_BRKETR_CNTRL_ETR_INV_Msk;
    TmpRegBRKETR_CNTRL |= (uint32_t)Polarity;
    TIMERx->BRKETR_CNTRL = TmpRegBRKETR_CNTRL;
}

/**
 * @brief  Configures the TIMERx BRK input inversion.
 * @param  TIMERx: select the TIMER peripheral.
 *         This parameter can be one of the following values: MDR_TIMER0, MDR_TIMER1.
 * @param  Polarity - @ref TIMER_BRK_Polarity_TypeDef - enables or disables inversion on BRK input.
 * @retval None.
 */
void TIMER_BRK_PolarityConfig(MDR_TIMER_TypeDef* TIMERx, TIMER_BRK_Polarity_TypeDef Polarity)
{
    uint32_t TmpRegBRKETR_CNTRL;

    /* Check the parameters */
    assert_param(IS_TIMER_ALL_PERIPH(TIMERx));
    assert_param(IS_TIMER_ETR_POLARITY(Polarity));

    TmpRegBRKETR_CNTRL = TIMERx->BRKETR_CNTRL;
    TmpRegBRKETR_CNTRL &= ~TIMER_BRKETR_CNTRL_BRK_INV_Msk;
    TmpRegBRKETR_CNTRL |= (uint32_t)Polarity;
    TIMERx->BRKETR_CNTRL = TmpRegBRKETR_CNTRL;
}

/**
 * @brief  Initializes the TIMERx Channel peripheral according to
 *         the specified parameters in the TIMER_ChInitStruct.
 * @param  TIMERx: select the TIMER peripheral.
 *         This parameter can be one of the following values: MDR_TIMER0, MDR_TIMER1.
 * @param  TIMER_ChInitStruct: pointer to a @ref TIMER_CH_InitTypeDef structure
 *         that contains the configuration information for the specified
 *         TIMER Channel peripheral.
 * @retval None.
 */
void TIMER_CH_Init(MDR_TIMER_TypeDef* TIMERx, const TIMER_CH_InitTypeDef* TIMER_ChInitStruct)
{
    uint32_t TmpRegCH_Number;
    uint32_t TmpRegCH_CNTRL;
    uint32_t TmpRegCH_CNTRL2;

    /* Check the parameters */
    assert_param(IS_TIMER_ALL_PERIPH(TIMERx));
    assert_param(IS_TIMER_CHANNEL_NUMBER(TIMER_ChInitStruct->TIMER_CH_Number));
    assert_param(IS_TIMER_CHANNEL_MODE(TIMER_ChInitStruct->TIMER_CH_Mode));
    assert_param(IS_FUNCTIONAL_STATE(TIMER_ChInitStruct->TIMER_CH_CCR1_Cmd));
    assert_param(IS_TIMER_CHANNEL_PWM_REF_FORMAT(TIMER_ChInitStruct->TIMER_CH_PWM_REF_Format));
    assert_param(IS_TIMER_CHANNEL_PWM_CCR_UPDATE_MODE(TIMER_ChInitStruct->TIMER_CH_PWM_CCR_UpdateMode));
    assert_param(IS_FUNCTIONAL_STATE(TIMER_ChInitStruct->TIMER_CH_PWM_ETR_Reset));
    assert_param(IS_FUNCTIONAL_STATE(TIMER_ChInitStruct->TIMER_CH_PWM_BRK_Reset));
    assert_param(IS_TIMER_CHANNEL_CAP_CCR_EVENT_SOURCE(TIMER_ChInitStruct->TIMER_CH_CAP_CCR_EventSource));
    assert_param(IS_TIMER_CHANNEL_CAP_CCR1_EVENT_SOURCE(TIMER_ChInitStruct->TIMER_CH_CAP_CCR1_EventSource));
    assert_param(IS_TIMER_CHANNEL_CAP_EVENT_PRESCALER(TIMER_ChInitStruct->TIMER_CH_CAP_EventPrescaler));
#if (defined USE_MDR32F23QI)
    assert_param(IS_FUNCTIONAL_STATE(TIMER_ChInitStruct->TIMER_CH_CAP_EventDelay));
#endif
    assert_param(IS_TIMER_CHANNEL_FILTER(TIMER_ChInitStruct->TIMER_CH_Filter));

    TmpRegCH_Number = (uint32_t)TIMER_ChInitStruct->TIMER_CH_Number;

    TmpRegCH_CNTRL = (uint32_t)TIMER_ChInitStruct->TIMER_CH_Mode |
                     (uint32_t)TIMER_ChInitStruct->TIMER_CH_PWM_REF_Format |
                     (uint32_t)TIMER_ChInitStruct->TIMER_CH_CAP_EventPrescaler |
                     (uint32_t)TIMER_ChInitStruct->TIMER_CH_CAP_CCR_EventSource |
                     (uint32_t)TIMER_ChInitStruct->TIMER_CH_Filter;

    if (TIMER_ChInitStruct->TIMER_CH_PWM_ETR_Reset != DISABLE) {
        TmpRegCH_CNTRL |= TIMER_CH_CNTRL_ETREN_Msk | TIMER_CH_CNTRL_OCCE_Msk;
    }

    if (TIMER_ChInitStruct->TIMER_CH_PWM_BRK_Reset != DISABLE) {
        TmpRegCH_CNTRL |= TIMER_CH_CNTRL_BRKEN_Msk;
    }

