piborisovich/microcontrollers/Milandr/Libraries/SPL/MDR32F2xQI/src/MDR32F2xQI_timer.c
    *(&TIMERx->CH1_CNTRL + TmpRegCH_Number) = TmpRegCH_CNTRL;

    TmpRegCH_CNTRL2 = (uint32_t)TIMER_ChInitStruct->TIMER_CH_PWM_CCR_UpdateMode |
                      (uint32_t)TIMER_ChInitStruct->TIMER_CH_CAP_CCR1_EventSource;

    if (TIMER_ChInitStruct->TIMER_CH_CCR1_Cmd != DISABLE) {
        TmpRegCH_CNTRL2 |= TIMER_CH_CNTRL2_CCR1_EN_Msk;
    }
#if (defined USE_MDR32F23QI)
    if (TIMER_ChInitStruct->TIMER_CH_CAP_EventDelay != DISABLE) {
        TmpRegCH_CNTRL2 |= TIMER_CH_CNTRL2_EV_DELAY_Msk;
    }
#endif
    *(&TIMERx->CH1_CNTRL2 + TmpRegCH_Number) = TmpRegCH_CNTRL2;
}

/**
 * @brief  Fills each TIMER_ChInitStruct member with its default value.
 * @param  TIMER_ChInitStruct: pointer to a @ref TIMER_CH_InitTypeDef structure
 *         which will be initialized.
 * @retval None.
 */
void TIMER_CH_StructInit(TIMER_CH_InitTypeDef* TIMER_ChInitStruct)
{
    TIMER_ChInitStruct->TIMER_CH_Number   = TIMER_CH1;
    TIMER_ChInitStruct->TIMER_CH_Mode     = TIMER_CH_MODE_PWM;
    TIMER_ChInitStruct->TIMER_CH_CCR1_Cmd = DISABLE;

    TIMER_ChInitStruct->TIMER_CH_PWM_REF_Format     = TIMER_CH_PWM_REF_FORMAT_0;
    TIMER_ChInitStruct->TIMER_CH_PWM_CCR_UpdateMode = TIMER_CH_PWM_CCR_UPD_IMMEDIATELY;
    TIMER_ChInitStruct->TIMER_CH_PWM_ETR_Reset      = DISABLE;
    TIMER_ChInitStruct->TIMER_CH_PWM_BRK_Reset      = DISABLE;

    TIMER_ChInitStruct->TIMER_CH_CAP_CCR_EventSource  = TIMER_CH_CAP_CCR_EVNT_SRC_RE;
    TIMER_ChInitStruct->TIMER_CH_CAP_CCR1_EventSource = TIMER_CH_CAP_CCR1_EVNT_SRC_RE;
    TIMER_ChInitStruct->TIMER_CH_CAP_EventPrescaler   = TIMER_CH_CAP_EVNT_PRESCALER_DIV_1;
#if defined(USE_MDR32F23QI)
    TIMER_ChInitStruct->TIMER_CH_CAP_EventDelay = ENABLE;
#endif
    TIMER_ChInitStruct->TIMER_CH_Filter = TIMER_CH_FILTER_1FF_AT_FDTS;
}

/**
 * @brief  Sets the TIMERx Channel Capture Compare Register (CCR) value.
 * @param  TIMERx: select the TIMER peripheral.
 *         This parameter can be one of the following values: MDR_TIMER0, MDR_TIMER1.
 * @param  Channel - @ref TIMER_CH_Number_TypeDef - specifies the Timer Channel number.
 * @param  CCR: specifies the Capture Compare Register (CCR) new value.
 * @retval None.
 */
void TIMER_CH_SetCCR(MDR_TIMER_TypeDef* TIMERx, TIMER_CH_Number_TypeDef Channel, uint16_t CCR)
{
    /* Check the parameters */
    assert_param(IS_TIMER_ALL_PERIPH(TIMERx));
    assert_param(IS_TIMER_CHANNEL_NUMBER(Channel));

    *(&TIMERx->CCR1 + (uint32_t)Channel) = CCR;
}

/**
 * @brief  Returns the TIMERx Channel Capture Compare Register (CCR) value.
 * @param  TIMERx: select the TIMER peripheral.
 *         This parameter can be one of the following values: MDR_TIMER0, MDR_TIMER1.
 * @param  Channel - @ref TIMER_CH_Number_TypeDef - specifies the Timer Channel number.
 * @retval Channel Capture Compare Register (CCR) value.
 */
uint16_t TIMER_CH_GetCCR(MDR_TIMER_TypeDef* TIMERx, TIMER_CH_Number_TypeDef Channel)
{
    /* Check the parameters */
    assert_param(IS_TIMER_ALL_PERIPH(TIMERx));
    assert_param(IS_TIMER_CHANNEL_NUMBER(Channel));

    return (uint16_t) * (&TIMERx->CCR1 + (uint32_t)Channel);
}

/**
 * @brief  Checks whether the TIMERx CCR write operation is in progress or not.
 * @param  TIMERx: select the TIMER peripheral.
 *         This parameter can be one of the following values: MDR_TIMER0, MDR_TIMER1.
 * @param  Channel - @ref TIMER_CH_Number_TypeDef - specifies the Timer Channel number.
 * @retval @ref FlagStatus - The CHy_CNTRL.WR_CMPL flag current state:
 *             @arg SET:   Write to CCR register in progress.
 *             @arg RESET: Write to CCR register completed.
 */
FlagStatus TIMER_CH_GetCCRWriteStatus(MDR_TIMER_TypeDef* TIMERx, TIMER_CH_Number_TypeDef Channel)
{
    __IO uint32_t* TmpPtrCH_CNTRL;
    FlagStatus     Status;

    /* Check the parameters */
    assert_param(IS_TIMER_ALL_PERIPH(TIMERx));
    assert_param(IS_TIMER_CHANNEL_NUMBER(Channel));

    TmpPtrCH_CNTRL = &TIMERx->CH1_CNTRL + (uint32_t)Channel;

    if ((*TmpPtrCH_CNTRL & TIMER_CH_CNTRL_WR_CMPL) == 0) {
        Status = RESET;
    } else {
        Status = SET;
    }

    return Status;
}

/**
 * @brief  Enables or disables the TIMERx Channel CCR1 register.
 * @param  TIMERx: select the TIMER peripheral.
 *         This parameter can be one of the following values: MDR_TIMER0, MDR_TIMER1.
 * @param  Channel - @ref TIMER_CH_Number_TypeDef - specifies the Timer Channel number.
 * @param  NewState - @ref FunctionalState - new state of the CCR1_EN bit.
 * @retval None.
 */
void TIMER_CH_CCR1Cmd(MDR_TIMER_TypeDef* TIMERx, TIMER_CH_Number_TypeDef Channel, FunctionalState NewState)
{
    __IO uint32_t* TmpPtrCH_CNTRL2;

    /* Check the parameters */
    assert_param(IS_TIMER_ALL_PERIPH(TIMERx));
    assert_param(IS_TIMER_CHANNEL_NUMBER(Channel));
    assert_param(IS_FUNCTIONAL_STATE(NewState));

    TmpPtrCH_CNTRL2 = &TIMERx->CH1_CNTRL2 + (uint32_t)Channel;

    /* Form new value */
    if (NewState != DISABLE) {
        /* Enable the TIMERx Channel CCR1 register by setting the CCR1_EN bit in the CHy_CNTRL2 register */
        *TmpPtrCH_CNTRL2 |= TIMER_CH_CNTRL2_CCR1_EN_Msk;
    } else {
        /* Disable the TIMERx Channel CCR1 register by clearing the CCR1_EN bit in the CHy_CNTRL2 register */
        *TmpPtrCH_CNTRL2 &= ~TIMER_CH_CNTRL2_CCR1_EN_Msk;
    }
}

/**
 * @brief  Sets the TIMERx Channel Capture Compare Register 1 (CCR1) value.
 * @param  TIMERx: select the TIMER peripheral.
 *         This parameter can be one of the following values: MDR_TIMER0, MDR_TIMER1.
 * @param  Channel - @ref TIMER_CH_Number_TypeDef - specifies the Timer Channel number.
 * @param  CCR1: specifies the Capture Compare Register 1 (CCR1) new value.
 * @retval None.
 */
void TIMER_CH_SetCCR1(MDR_TIMER_TypeDef* TIMERx, TIMER_CH_Number_TypeDef Channel, uint16_t CCR1)
{
    /* Check the parameters */
    assert_param(IS_TIMER_ALL_PERIPH(TIMERx));
    assert_param(IS_TIMER_CHANNEL_NUMBER(Channel));

    *(&TIMERx->CCR11 + (uint32_t)Channel) = CCR1;
}

/**
 * @brief  Returns the TIMERx Channel Capture Compare Register 1 (CCR1) value.
 * @param  TIMERx: select the TIMER peripheral.
 *         This parameter can be one of the following values: MDR_TIMER0, MDR_TIMER1.
 * @param  Channel - @ref TIMER_CH_Number_TypeDef - specifies the Timer Channel number.
 * @retval Channel Capture Compare Register 1 (CCR1) value.
 */
uint16_t TIMER_CH_GetCCR1(MDR_TIMER_TypeDef* TIMERx, TIMER_CH_Number_TypeDef Channel)
{
    /* Check the parameters */
    assert_param(IS_TIMER_ALL_PERIPH(TIMERx));
    assert_param(IS_TIMER_CHANNEL_NUMBER(Channel));

