piborisovich/microcontrollers/Milandr/Libraries/SPL/MDR32F2xQI/src/MDR32F2xQI_timer.c
    return (uint16_t) * (&TIMERx->CCR11 + (uint32_t)Channel);
}

/**
 * @brief  Checks whether the TIMERx CCR1 write operation is in progress or not.
 * @param  TIMERx: select the TIMER peripheral.
 *         This parameter can be one of the following values: MDR_TIMER0, MDR_TIMER1.
 * @param  Channel - @ref TIMER_CH_Number_TypeDef - specifies the Timer Channel number.
 * @retval @ref FlagStatus - The CHy_CNTRL.WR_CMPL1 flag current state:
 *             @arg SET:   Write to CCR1 register in progress.
 *             @arg RESET: Write to CCR1 register completed.
 */
FlagStatus TIMER_CH_GetCCR1WriteStatus(MDR_TIMER_TypeDef* TIMERx, TIMER_CH_Number_TypeDef Channel)
{
    __IO uint32_t* TmpPtrCH_CNTRL;
    FlagStatus     Status;

    /* Check the parameters */
    assert_param(IS_TIMER_ALL_PERIPH(TIMERx));
    assert_param(IS_TIMER_CHANNEL_NUMBER(Channel));

    TmpPtrCH_CNTRL = &TIMERx->CH1_CNTRL + (uint32_t)Channel;

    if ((*TmpPtrCH_CNTRL & TIMER_CH_CNTRL_WR_CMPL1) == 0) {
        Status = RESET;
    } else {
        Status = SET;
    }

    return Status;
}

/**
 * @brief  Sets the TIMERx Channel Capture Compare Registers (CCR and CCR1) update mode.
 * @param  TIMERx: select the TIMER peripheral.
 *         This parameter can be one of the following values: MDR_TIMER0, MDR_TIMER1.
 * @param  Channel - @ref TIMER_CH_Number_TypeDef - specifies the Timer Channel number.
 * @param  UpdateMode - @ref TIMER_CH_PWM_CCR_UpdateMode_TypeDef - specifies the Capture Compare Registers (CCR and CCR1) update mode.
 * @retval None.
 */
void TIMER_CH_PWM_SetCompareUpdateMode(MDR_TIMER_TypeDef* TIMERx, TIMER_CH_Number_TypeDef Channel, TIMER_CH_PWM_CCR_UpdateMode_TypeDef UpdateMode)
{
    __IO uint32_t* TmpPtrCH_CNTRL2;
    uint32_t       TmpRegCH_CNTRL2;

    /* Check the parameters */
    assert_param(IS_TIMER_ALL_PERIPH(TIMERx));
    assert_param(IS_TIMER_CHANNEL_NUMBER(Channel));
    assert_param(IS_TIMER_CHANNEL_PWM_CCR_UPDATE_MODE(UpdateMode));

    TmpPtrCH_CNTRL2 = &TIMERx->CH1_CNTRL2 + (uint32_t)Channel;

    TmpRegCH_CNTRL2 = *TmpPtrCH_CNTRL2;
    TmpRegCH_CNTRL2 &= ~TIMER_CH_CNTRL2_CCRRLD_Msk;
    TmpRegCH_CNTRL2 |= (uint32_t)UpdateMode;
    *TmpPtrCH_CNTRL2 = TmpRegCH_CNTRL2;
}

/**
 * @brief  Configures the TIMERx REF signal format.
 * @param  TIMERx: select the TIMER peripheral.
 *         This parameter can be one of the following values: MDR_TIMER0, MDR_TIMER1.
 * @param  Channel - @ref TIMER_CH_Number_TypeDef - specifies the Timer Channel number.
 * @param  Format - @ref TIMER_CH_PWM_REF_Format_TypeDef - new value of the REF signal format.
 * @retval None.
 */
void TIMER_CH_PWM_REF_FormatConfig(MDR_TIMER_TypeDef* TIMERx, TIMER_CH_Number_TypeDef Channel, TIMER_CH_PWM_REF_Format_TypeDef Format)
{
    __IO uint32_t* TmpPtrCH_CNTRL;
    uint32_t       TmpRegCH_CNTRL;

    /* Check the parameters */
    assert_param(IS_TIMER_ALL_PERIPH(TIMERx));
    assert_param(IS_TIMER_CHANNEL_NUMBER(Channel));
    assert_param(IS_TIMER_CHANNEL_PWM_REF_FORMAT(Format));

    TmpPtrCH_CNTRL = &TIMERx->CH1_CNTRL + (uint32_t)Channel;

    TmpRegCH_CNTRL = *TmpPtrCH_CNTRL;
    TmpRegCH_CNTRL &= ~TIMER_CH_CNTRL_OCCM_Msk;
    TmpRegCH_CNTRL |= (uint32_t)Format;
    *TmpPtrCH_CNTRL = TmpRegCH_CNTRL;
}

/**
 * @brief  Enables or disables TIMERx Channel ETR Reset (REF reset when ETR input is high).
 * @param  TIMERx: select the TIMER peripheral.
 *         This parameter can be one of the following values: MDR_TIMER0, MDR_TIMER1.
 * @param  Channel - @ref TIMER_CH_Number_TypeDef - specifies the Timer Channel number.
 * @param  NewState - @ref FunctionalState - new state of the ETR Reset.
 * @retval None.
 */
void TIMER_CH_PWM_ETR_ResetCmd(MDR_TIMER_TypeDef* TIMERx, TIMER_CH_Number_TypeDef Channel, FunctionalState NewState)
{
    __IO uint32_t* TmpPtrCH_CNTRL;

    /* Check the parameters */
    assert_param(IS_TIMER_ALL_PERIPH(TIMERx));
    assert_param(IS_TIMER_CHANNEL_NUMBER(Channel));
    assert_param(IS_FUNCTIONAL_STATE(NewState));

    TmpPtrCH_CNTRL = &TIMERx->CH1_CNTRL + (uint32_t)Channel;

    /* Form new value */
    if (NewState != DISABLE) {
        /* Enable the TIMERx Channel ETR Reset by setting the ETREN and OCCE bits in the CHy_CNTRL register */
        *TmpPtrCH_CNTRL |= TIMER_CH_CNTRL_ETREN_Msk | TIMER_CH_CNTRL_OCCE_Msk;
    } else {
        /* Disable the TIMERx Channel ETR Reset by clearing the ETREN and OCCE bits in the CHy_CNTRL register */
        *TmpPtrCH_CNTRL &= ~(TIMER_CH_CNTRL_ETREN_Msk | TIMER_CH_CNTRL_OCCE_Msk);
    }
}

/**
 * @brief  Enables or disables TIMERx Channel BKR Reset (REF and DTG reset when BKR input is low).
 * @param  TIMERx: select the TIMER peripheral.
 *         This parameter can be one of the following values: MDR_TIMER0, MDR_TIMER1.
 * @param  Channel - @ref TIMER_CH_Number_TypeDef - specifies the Timer Channel number.
 * @param  NewState - @ref FunctionalState - new state of the BRK Reset.
 * @retval None.
 */
void TIMER_CH_PWM_BRK_ResetCmd(MDR_TIMER_TypeDef* TIMERx, TIMER_CH_Number_TypeDef Channel, FunctionalState NewState)
{
    __IO uint32_t* TmpPtrCH_CNTRL;

    /* Check the parameters */
    assert_param(IS_TIMER_ALL_PERIPH(TIMERx));
    assert_param(IS_TIMER_CHANNEL_NUMBER(Channel));
    assert_param(IS_FUNCTIONAL_STATE(NewState));

    TmpPtrCH_CNTRL = &TIMERx->CH1_CNTRL + (uint32_t)Channel;

    /* Form new value */
    if (NewState != DISABLE) {
        /* Enable the TIMERx Channel BRK Reset by setting the BRKEN bit in the CHy_CNTRL register */
        *TmpPtrCH_CNTRL |= TIMER_CH_CNTRL_BRKEN_Msk;
    } else {
        /* Disable the TIMERx Channel BRK Reset by clearing the BRKEN bit in the CHy_CNTRL register */
        *TmpPtrCH_CNTRL &= ~TIMER_CH_CNTRL_BRKEN_Msk;
    }
}

/**
 * @brief  Configures the TIMERx Capture events prescaler value.
 * @param  TIMERx: select the TIMER peripheral.
 *         This parameter can be one of the following values: MDR_TIMER0, MDR_TIMER1.
 * @param  Channel - @ref TIMER_CH_Number_TypeDef - specifies the Timer Channel number.
 * @param  Prescaler - @ref TIMER_CH_CAP_EventPrescaler_TypeDef - specifies the Capture evens prescaler value.
 * @retval None.
 */
void TIMER_CH_CAP_SetEventPrescaler(MDR_TIMER_TypeDef* TIMERx, TIMER_CH_Number_TypeDef Channel, TIMER_CH_CAP_EventPrescaler_TypeDef Prescaler)
{
    __IO uint32_t* TmpPtrCH_CNTRL;
    uint32_t       TmpRegCH_CNTRL;

    /* Check the parameters */
    assert_param(IS_TIMER_ALL_PERIPH(TIMERx));
    assert_param(IS_TIMER_CHANNEL_NUMBER(Channel));
    assert_param(IS_TIMER_CHANNEL_CAP_EVENT_PRESCALER(Prescaler));

