piborisovich/microcontrollers/Milandr/Libraries/SPL/MDR32F2xQI/src/MDR32F2xQI_timer.c
    TmpPtrCH_CNTRL = &TIMERx->CH1_CNTRL + (uint32_t)Channel;

    TmpRegCH_CNTRL = *TmpPtrCH_CNTRL;
    TmpRegCH_CNTRL &= ~TIMER_CH_CNTRL_CHPSC_Msk;
    TmpRegCH_CNTRL |= (uint32_t)Prescaler;
    *TmpPtrCH_CNTRL = TmpRegCH_CNTRL;
}

/**
 * @brief  Configures the TIMERx Channel Capture Event source for the CCR register.
 * @param  TIMERx: select the TIMER peripheral.
 *         This parameter can be one of the following values: MDR_TIMER0, MDR_TIMER1.
 * @param  Channel - @ref TIMER_CH_Number_TypeDef - specifies the Timer Channel number.
 * @param  EventSource - @ref TIMER_CH_CAP_CCR_EventSource_TypeDef - specifies the Event source for the CCR register.
 * @retval None.
 */
void TIMER_CH_CAP_EventSourceConfig(MDR_TIMER_TypeDef* TIMERx, TIMER_CH_Number_TypeDef Channel, TIMER_CH_CAP_CCR_EventSource_TypeDef EventSource)
{
    __IO uint32_t* TmpPtrCH_CNTRL;
    uint32_t       TmpRegCH_CNTRL;

    /* Check the parameters */
    assert_param(IS_TIMER_ALL_PERIPH(TIMERx));
    assert_param(IS_TIMER_CHANNEL_NUMBER(Channel));
    assert_param(IS_TIMER_CHANNEL_CAP_CCR_EVENT_SOURCE(EventSource));

    TmpPtrCH_CNTRL = &TIMERx->CH1_CNTRL + (uint32_t)Channel;

    TmpRegCH_CNTRL = *TmpPtrCH_CNTRL;
    TmpRegCH_CNTRL &= ~TIMER_CH_CNTRL_CHSEL_Msk;
    TmpRegCH_CNTRL |= (uint32_t)EventSource;
    *TmpPtrCH_CNTRL = TmpRegCH_CNTRL;
}

/**
 * @brief  Configures the TIMERx Channel Capture Event source for the CCR1 register.
 * @param  TIMERx: select the TIMER peripheral.
 *         This parameter can be one of the following values: MDR_TIMER0, MDR_TIMER1.
 * @param  Channel - @ref TIMER_CH_Number_TypeDef - specifies the Timer Channel number.
 * @param  Event1Source - @ref TIMER_CH_CAP_CCR1_EventSource_TypeDef - specifies the Event source for the CCR1 register.
 * @retval None.
 */
void TIMER_CH_CAP_Event1SourceConfig(MDR_TIMER_TypeDef* TIMERx, TIMER_CH_Number_TypeDef Channel, TIMER_CH_CAP_CCR1_EventSource_TypeDef Event1Source)
{
    __IO uint32_t* TmpPtrCH_CNTRL2;
    uint32_t       TmpRegCH_CNTRL2;

    /* Check the parameters */
    assert_param(IS_TIMER_ALL_PERIPH(TIMERx));
    assert_param(IS_TIMER_CHANNEL_NUMBER(Channel));
    assert_param(IS_TIMER_CHANNEL_CAP_CCR1_EVENT_SOURCE(Event1Source));

    TmpPtrCH_CNTRL2 = &TIMERx->CH1_CNTRL2 + (uint32_t)Channel;

    TmpRegCH_CNTRL2 = *TmpPtrCH_CNTRL2;
    TmpRegCH_CNTRL2 &= ~TIMER_CH_CNTRL2_CHSEL_Msk;
    TmpRegCH_CNTRL2 |= (uint32_t)Event1Source;
    *TmpPtrCH_CNTRL2 = TmpRegCH_CNTRL2;
}

#if (defined USE_MDR32F23QI)
/**
 * @brief  Enables or disables synchronization between the capture event and the update of registers CCR and CCR1.
 * @param  TIMERx: select the TIMER peripheral.
 *         This parameter can be one of the following values: MDR_TIMER0, MDR_TIMER1.
 * @param  Channel - @ref TIMER_CH_Number_TypeDef - specifies the Timer Channel number.
 * @param  NewState - @ref FunctionalState - new state of the EV_DELAY bit.
 * @retval None
 */
void TIMER_CH_CAP_EventDelayCmd(MDR_TIMER_TypeDef* TIMERx, TIMER_CH_Number_TypeDef Channel, FunctionalState NewState)
{
    __IO uint32_t* TmpPtrCH_CNTRL2;

    /* Check the parameters */
    assert_param(IS_TIMER_ALL_PERIPH(TIMERx));
    assert_param(IS_TIMER_CHANNEL_NUMBER(Channel));
    assert_param(IS_FUNCTIONAL_STATE(NewState));

    TmpPtrCH_CNTRL2 = &TIMERx->CH1_CNTRL2 + (uint32_t)Channel;

    /* Form new value */
    if (NewState != DISABLE) {
        /* Enable the TIMERx Channel event delay by setting the EV_DELAY bit in the CHy_CNTRL2 register */
        *TmpPtrCH_CNTRL2 |= TIMER_CH_CNTRL2_EV_DELAY_Msk;
    } else {
        /* Disable the TIMERx Channel event delay by clearing the EV_DELAY bit in the CHy_CNTRL2 register */
        *TmpPtrCH_CNTRL2 &= ~TIMER_CH_CNTRL2_EV_DELAY_Msk;
    }
}
#endif

/**
 * @brief  Configures the TIMERx Channel Filter peripheral.
 * @param  TIMERx: select the TIMER peripheral.
 *         This parameter can be one of the following values: MDR_TIMER0, MDR_TIMER1.
 * @param  Channel - @ref TIMER_CH_Number_TypeDef - specifies the Timer Channel number.
 * @param  Filter - @ref TIMER_CH_Filter_TypeDef - specifies the Channel Filter configuration.
 * @retval None.
 */
void TIMER_CH_FilterConfig(MDR_TIMER_TypeDef* TIMERx, TIMER_CH_Number_TypeDef Channel, TIMER_CH_Filter_TypeDef Filter)
{
    __IO uint32_t* TmpPtrCH_CNTRL;
    uint32_t       TmpRegCH_CNTRL;

    /* Check the parameters */
    assert_param(IS_TIMER_ALL_PERIPH(TIMERx));
    assert_param(IS_TIMER_CHANNEL_NUMBER(Channel));
    assert_param(IS_TIMER_CHANNEL_FILTER(Filter));

    TmpPtrCH_CNTRL = &TIMERx->CH1_CNTRL + (uint32_t)Channel;

    TmpRegCH_CNTRL = *TmpPtrCH_CNTRL;
    TmpRegCH_CNTRL &= ~TIMER_CH_CNTRL_CHFLTR_Msk;
    TmpRegCH_CNTRL |= (uint32_t)Filter;
    *TmpPtrCH_CNTRL = TmpRegCH_CNTRL;
}

/**
 * @brief  Initializes the TIMERx Channel Output peripheral according to
 *         the specified parameters in the TIMER_ChOutInitStruct.
 * @param  TIMERx: select the TIMER peripheral.
 *         This parameter can be one of the following values: MDR_TIMER0, MDR_TIMER1.
 * @param  TIMER_ChOutInitStruct: pointer to a @ref TIMER_CH_OUT_InitTypeDef structure
 *         that contains the configuration information for the specified
 *         TIMER Channel Outputs peripheral.
 * @retval None.
 */
void TIMER_CH_OUT_Init(MDR_TIMER_TypeDef* TIMERx, const TIMER_CH_OUT_InitTypeDef* TIMER_ChOutInitStruct)
{
    uint32_t TmpRegCH_Number;
    uint32_t TmpRegCH_CNTRL1;
    uint32_t TmpRegCH_DTG;

    /* Check the parameters */
    assert_param(IS_TIMER_ALL_PERIPH(TIMERx));
    assert_param(IS_TIMER_CHANNEL_NUMBER(TIMER_ChOutInitStruct->TIMER_CH_Number));
    assert_param(IS_TIMER_CHANNEL_OUTP_POLARITY(TIMER_ChOutInitStruct->TIMER_CH_OUTP_Polarity));
    assert_param(IS_TIMER_CHANNEL_OUTP_SOURCE(TIMER_ChOutInitStruct->TIMER_CH_OUTP_Source));
    assert_param(IS_TIMER_CHANNEL_OUTP_MODE(TIMER_ChOutInitStruct->TIMER_CH_OUTP_Mode));
    assert_param(IS_TIMER_CHANNEL_OUTN_POLARITY(TIMER_ChOutInitStruct->TIMER_CH_OUTN_Polarity));
    assert_param(IS_TIMER_CHANNEL_OUTN_SOURCE(TIMER_ChOutInitStruct->TIMER_CH_OUTN_Source));
    assert_param(IS_TIMER_CHANNEL_OUTN_MODE(TIMER_ChOutInitStruct->TIMER_CH_OUTN_Mode));
    assert_param(IS_TIMER_CHANNEL_DTG_CLK_SOURCE(TIMER_ChOutInitStruct->TIMER_CH_DTG_ClockSource));
    assert_param(IS_TIMER_CHANNEL_DTG_AUX_PRESCALER(TIMER_ChOutInitStruct->TIMER_CH_DTG_AuxPrescaler));

    TmpRegCH_Number = (uint32_t)TIMER_ChOutInitStruct->TIMER_CH_Number;

    TmpRegCH_CNTRL1 = (uint32_t)TIMER_ChOutInitStruct->TIMER_CH_OUTP_Polarity |
                      (uint32_t)TIMER_ChOutInitStruct->TIMER_CH_OUTP_Source |
                      (uint32_t)TIMER_ChOutInitStruct->TIMER_CH_OUTP_Mode |
                      (uint32_t)TIMER_ChOutInitStruct->TIMER_CH_OUTN_Polarity |
                      (uint32_t)TIMER_ChOutInitStruct->TIMER_CH_OUTN_Source |
                      (uint32_t)TIMER_ChOutInitStruct->TIMER_CH_OUTN_Mode;

    *(&TIMERx->CH1_CNTRL1 + TmpRegCH_Number) = TmpRegCH_CNTRL1;

    TmpRegCH_DTG = ((uint32_t)TIMER_ChOutInitStruct->TIMER_CH_DTG_MainPrescaler << TIMER_CH_DTG_DTG_Pos) |
                   ((uint32_t)TIMER_ChOutInitStruct->TIMER_CH_DTG_AuxPrescaler << TIMER_CH_DTG_DTGX_Pos) |
                   (uint32_t)TIMER_ChOutInitStruct->TIMER_CH_DTG_ClockSource;

    *(&TIMERx->CH1_DTG + TmpRegCH_Number) = TmpRegCH_DTG;
}

/**
 * @brief  Fills each TIMER_ChOutInitStruct member with its default value.
 * @param  TIMER_ChOutInitStruct: pointer to a @ref TIMER_CH_OUT_InitTypeDef structure
 *         which will be initialized.
 * @retval None.
 */
void TIMER_CH_OUT_StructInit(TIMER_CH_OUT_InitTypeDef* TIMER_ChOutInitStruct)
{
    TIMER_ChOutInitStruct->TIMER_CH_Number = TIMER_CH1;

    TIMER_ChOutInitStruct->TIMER_CH_OUTP_Polarity = TIMER_CH_OUTP_POLARITY_NON_INV;
    TIMER_ChOutInitStruct->TIMER_CH_OUTP_Source   = TIMER_CH_OUTP_SRC_0;
    TIMER_ChOutInitStruct->TIMER_CH_OUTP_Mode     = TIMER_CH_OUTP_MODE_IN;

    TIMER_ChOutInitStruct->TIMER_CH_OUTN_Polarity = TIMER_CH_OUTN_POLARITY_NON_INV;
    TIMER_ChOutInitStruct->TIMER_CH_OUTN_Source   = TIMER_CH_OUTN_SRC_0;
    TIMER_ChOutInitStruct->TIMER_CH_OUTN_Mode     = TIMER_CH_OUTN_MODE_IN;

    TIMER_ChOutInitStruct->TIMER_CH_DTG_ClockSource   = TIMER_CH_DTG_CLK_SRC_TIM_CLK;
    TIMER_ChOutInitStruct->TIMER_CH_DTG_MainPrescaler = 0;
    TIMER_ChOutInitStruct->TIMER_CH_DTG_AuxPrescaler  = 0;
}

/**
 * @brief  Configures the TIMERx Dead Time Generator (DTG) peripheral.
 * @param  TIMERx: select the TIMER peripheral.
 *         This parameter can be one of the following values: MDR_TIMER0, MDR_TIMER1.
 * @param  Channel - @ref TIMER_CH_Number_TypeDef - specifies the Timer Channel number.
 * @param  MainPrescaler: specifies the Main Prescaler value.
 *         This parameter can be a number between 0x00 and 0xFF.
 * @param  AuxPrescaler: specifies the Auxiliary Prescaler value.
 *         This parameter can be a number between 0x00 and 0x0F.
 * @param  ClockSource - @ref TIMER_CH_DTG_ClockSource_TypeDef - specifies the DTG clock source.
 * @retval None.
 */
void TIMER_CH_OUT_DTGConfig(MDR_TIMER_TypeDef* TIMERx, TIMER_CH_Number_TypeDef Channel, uint8_t MainPrescaler, uint8_t AuxPrescaler, TIMER_CH_DTG_ClockSource_TypeDef ClockSource)
{
    uint32_t TmpRegCH_DTG;

    /* Check the parameters */
    assert_param(IS_TIMER_ALL_PERIPH(TIMERx));
    assert_param(IS_TIMER_CHANNEL_NUMBER(Channel));
    assert_param(IS_TIMER_CHANNEL_DTG_AUX_PRESCALER(AuxPrescaler));
    assert_param(IS_TIMER_CHANNEL_DTG_CLK_SOURCE(ClockSource));

    TmpRegCH_DTG = ((uint32_t)MainPrescaler << TIMER_CH_DTG_DTG_Pos) |
                   ((uint32_t)AuxPrescaler << TIMER_CH_DTG_DTGX_Pos) |
                   (uint32_t)ClockSource;

