piborisovich/microcontrollers/Milandr/Libraries/SPL/MDR32F2xQI/src/MDR32F2xQI_timer.c
    *(&TIMERx->CH1_DTG + (uint32_t)Channel) = TmpRegCH_DTG;
}

/**
 * @brief  Configures the TIMERx Channel positive output.
 * @param  TIMERx: select the TIMER peripheral.
 *         This parameter can be one of the following values: MDR_TIMER0, MDR_TIMER1.
 * @param  Channel - @ref TIMER_CH_Number_TypeDef - specifies the Timer Channel number.
 * @param  OutSource - @ref TIMER_CH_OUTP_Source_TypeDef - specifies the Channel Positive Output source.
 * @param  Mode - @ref TIMER_CH_OUTP_Mode_TypeDef - specifies the Channel Positive Output mode (output enable source).
 * @param  Polarity - @ref TIMER_CH_OUTP_Polarity_TypeDef - enables or disables the Channel Positive Output inversion.
 * @retval None.
 */
void TIMER_CH_OUTP_Config(MDR_TIMER_TypeDef* TIMERx, TIMER_CH_Number_TypeDef Channel, TIMER_CH_OUTP_Source_TypeDef OutSource, TIMER_CH_OUTP_Mode_TypeDef Mode, TIMER_CH_OUTP_Polarity_TypeDef Polarity)
{
    __IO uint32_t* TmpPtrCH_CNTRL1;
    uint32_t       TmpRegCH_CNTRL1;

    /* Check the parameters */
    assert_param(IS_TIMER_ALL_PERIPH(TIMERx));
    assert_param(IS_TIMER_CHANNEL_NUMBER(Channel));
    assert_param(IS_TIMER_CHANNEL_OUTP_SOURCE(OutSource));
    assert_param(IS_TIMER_CHANNEL_OUTP_MODE(Mode));
    assert_param(IS_TIMER_CHANNEL_OUTP_POLARITY(Polarity));

    TmpPtrCH_CNTRL1 = &TIMERx->CH1_CNTRL1 + (uint32_t)Channel;

    TmpRegCH_CNTRL1 = *TmpPtrCH_CNTRL1;
    TmpRegCH_CNTRL1 &= ~(TIMER_CH_CNTRL1_INV_Msk | TIMER_CH_CNTRL1_SELO_Msk | TIMER_CH_CNTRL1_SELOE_Msk);
    TmpRegCH_CNTRL1 |= (uint32_t)Polarity |
                       (uint32_t)OutSource |
                       (uint32_t)Mode;
    *TmpPtrCH_CNTRL1 = TmpRegCH_CNTRL1;
}

/**
 * @brief  Configures the TIMERx Channel Positive Output source.
 * @param  TIMERx: select the TIMER peripheral.
 *         This parameter can be one of the following values: MDR_TIMER0, MDR_TIMER1.
 * @param  Channel - @ref TIMER_CH_Number_TypeDef - specifies the Timer Channel number.
 * @param  OutSource - @ref TIMER_CH_OUTP_Source_TypeDef - specifies the Channel Positive Output source.
 * @retval None.
 */
void TIMER_CH_OUTP_SourceConfig(MDR_TIMER_TypeDef* TIMERx, TIMER_CH_Number_TypeDef Channel, TIMER_CH_OUTP_Source_TypeDef OutSource)
{
    __IO uint32_t* TmpPtrCH_CNTRL1;
    uint32_t       TmpRegCH_CNTRL1;

    /* Check the parameters */
    assert_param(IS_TIMER_ALL_PERIPH(TIMERx));
    assert_param(IS_TIMER_CHANNEL_NUMBER(Channel));
    assert_param(IS_TIMER_CHANNEL_OUTP_SOURCE(OutSource));

    TmpPtrCH_CNTRL1 = &TIMERx->CH1_CNTRL1 + (uint32_t)Channel;

    TmpRegCH_CNTRL1 = *TmpPtrCH_CNTRL1;
    TmpRegCH_CNTRL1 &= ~TIMER_CH_CNTRL1_SELO_Msk;
    TmpRegCH_CNTRL1 |= (uint32_t)OutSource;
    *TmpPtrCH_CNTRL1 = TmpRegCH_CNTRL1;
}

/**
 * @brief  Configures the TIMERx Channel Positive Output mode (enable source).
 * @param  TIMERx: select the TIMER peripheral.
 *         This parameter can be one of the following values: MDR_TIMER0, MDR_TIMER1.
 * @param  Channel - @ref TIMER_CH_Number_TypeDef - specifies the Timer Channel number.
 * @param  Mode - @ref TIMER_CH_OUTP_Mode_TypeDef - specifies the Channel Positive Output mode (output enable source).
 * @retval None.
 */
void TIMER_CH_OUTP_ModeConfig(MDR_TIMER_TypeDef* TIMERx, TIMER_CH_Number_TypeDef Channel, TIMER_CH_OUTP_Mode_TypeDef Mode)
{
    __IO uint32_t* TmpPtrCH_CNTRL1;
    uint32_t       TmpRegCH_CNTRL1;

    /* Check the parameters */
    assert_param(IS_TIMER_ALL_PERIPH(TIMERx));
    assert_param(IS_TIMER_CHANNEL_NUMBER(Channel));
    assert_param(IS_TIMER_CHANNEL_OUTP_MODE(Mode));

    TmpPtrCH_CNTRL1 = &TIMERx->CH1_CNTRL1 + (uint32_t)Channel;

    TmpRegCH_CNTRL1 = *TmpPtrCH_CNTRL1;
    TmpRegCH_CNTRL1 &= ~TIMER_CH_CNTRL1_SELOE_Msk;
    TmpRegCH_CNTRL1 |= (uint32_t)Mode;
    *TmpPtrCH_CNTRL1 = TmpRegCH_CNTRL1;
}

/**
 * @brief  Configures the TIMERx Channel Positive Output polarity.
 * @param  TIMERx: select the TIMER peripheral.
 *         This parameter can be one of the following values: MDR_TIMER0, MDR_TIMER1.
 * @param  Channel - @ref TIMER_CH_Number_TypeDef - specifies the Timer Channel number.
 * @param  Polarity - @ref TIMER_CH_OUTP_Polarity_TypeDef - enables or disables the Channel Positive Output inversion.
 * @retval None
 */
void TIMER_CH_OUTP_PolarityConfig(MDR_TIMER_TypeDef* TIMERx, TIMER_CH_Number_TypeDef Channel, TIMER_CH_OUTP_Polarity_TypeDef Polarity)
{
    __IO uint32_t* TmpPtrCH_CNTRL1;
    uint32_t       TmpRegCH_CNTRL1;

    /* Check the parameters */
    assert_param(IS_TIMER_ALL_PERIPH(TIMERx));
    assert_param(IS_TIMER_CHANNEL_NUMBER(Channel));
    assert_param(IS_TIMER_CHANNEL_OUTP_POLARITY(Polarity));

    TmpPtrCH_CNTRL1 = &TIMERx->CH1_CNTRL1 + (uint32_t)Channel;

    TmpRegCH_CNTRL1 = *TmpPtrCH_CNTRL1;
    TmpRegCH_CNTRL1 &= ~TIMER_CH_CNTRL1_INV_Msk;
    TmpRegCH_CNTRL1 |= (uint32_t)Polarity;
    *TmpPtrCH_CNTRL1 = TmpRegCH_CNTRL1;
}

/**
 * @brief  Configures the TIMERx Channel Negative Output.
 * @param  TIMERx: select the TIMER peripheral.
 *         This parameter can be one of the following values: MDR_TIMER0, MDR_TIMER1.
 * @param  Channel - @ref TIMER_CH_Number_TypeDef - specifies the Timer Channel number.
 * @param  OutSource - @ref TIMER_CH_OUTN_Source_TypeDef - specifies the Channel Negative Output source.
 * @param  Mode - @ref TIMER_CH_OUTN_Mode_TypeDef - specifies the Channel Negative Output mode (output enable source).
 * @param  Polarity - @ref TIMER_CH_OUTN_Polarity_TypeDef - enables or disables the Channel Negative Output inversion.
 * @retval None.
 */
void TIMER_CH_OUTN_Config(MDR_TIMER_TypeDef* TIMERx, TIMER_CH_Number_TypeDef Channel, TIMER_CH_OUTN_Source_TypeDef OutSource, TIMER_CH_OUTN_Mode_TypeDef Mode, TIMER_CH_OUTN_Polarity_TypeDef Polarity)
{
    __IO uint32_t* TmpPtrCH_CNTRL1;
    uint32_t       TmpRegCH_CNTRL1;

    /* Check the parameters */
    assert_param(IS_TIMER_ALL_PERIPH(TIMERx));
    assert_param(IS_TIMER_CHANNEL_NUMBER(Channel));
    assert_param(IS_TIMER_CHANNEL_OUTN_SOURCE(OutSource));
    assert_param(IS_TIMER_CHANNEL_OUTN_MODE(Mode));
    assert_param(IS_TIMER_CHANNEL_OUTN_POLARITY(Polarity));

    TmpPtrCH_CNTRL1 = &TIMERx->CH1_CNTRL1 + (uint32_t)Channel;

    TmpRegCH_CNTRL1 = *TmpPtrCH_CNTRL1;
    TmpRegCH_CNTRL1 &= ~(TIMER_CH_CNTRL1_NINV_Msk | TIMER_CH_CNTRL1_NSELO_Msk | TIMER_CH_CNTRL1_NSELOE_Msk);
    TmpRegCH_CNTRL1 |= (uint32_t)Polarity |
                       (uint32_t)OutSource |
                       (uint32_t)Mode;
    *TmpPtrCH_CNTRL1 = TmpRegCH_CNTRL1;
}

/**
 * @brief  Configures the TIMERx Channel Negative Output source.
 * @param  TIMERx: select the TIMER peripheral.
 *         This parameter can be one of the following values: MDR_TIMER0, MDR_TIMER1.
 * @param  Channel - @ref TIMER_CH_Number_TypeDef - specifies the Timer Channel number.
 * @param  OutSource - @ref TIMER_CH_OUTN_Source_TypeDef - specifies the Channel Negative Output source.
 * @retval None.
 */
void TIMER_CH_OUTN_SourceConfig(MDR_TIMER_TypeDef* TIMERx, TIMER_CH_Number_TypeDef Channel, TIMER_CH_OUTN_Source_TypeDef OutSource)
{
    __IO uint32_t* TmpPtrCH_CNTRL1;
    uint32_t       TmpRegCH_CNTRL1;

    /* Check the parameters */
    assert_param(IS_TIMER_ALL_PERIPH(TIMERx));
    assert_param(IS_TIMER_CHANNEL_NUMBER(Channel));
    assert_param(IS_TIMER_CHANNEL_OUTN_SOURCE(OutSource));

    TmpPtrCH_CNTRL1 = &TIMERx->CH1_CNTRL1 + (uint32_t)Channel;

    TmpRegCH_CNTRL1 = *TmpPtrCH_CNTRL1;
    TmpRegCH_CNTRL1 &= ~TIMER_CH_CNTRL1_NSELO_Msk;
    TmpRegCH_CNTRL1 |= (uint32_t)OutSource;
    *TmpPtrCH_CNTRL1 = TmpRegCH_CNTRL1;
}

/**
 * @brief  Configures the TIMERx Channel Negative Output mode.
 * @param  TIMERx: select the TIMER peripheral.
 *         This parameter can be one of the following values: MDR_TIMER0, MDR_TIMER1.
 * @param  Channel - @ref TIMER_CH_Number_TypeDef - specifies the Timer Channel number.
 * @param  Mode - @ref TIMER_CH_OUTN_Mode_TypeDef - specifies the NChannel Negative Output mode (output enable source).
 * @retval None.
 */
void TIMER_CH_OUTN_ModeConfig(MDR_TIMER_TypeDef* TIMERx, TIMER_CH_Number_TypeDef Channel, TIMER_CH_OUTN_Mode_TypeDef Mode)
{
    __IO uint32_t* TmpPtrCH_CNTRL1;
    uint32_t       TmpRegCH_CNTRL1;

    /* Check the parameters */
    assert_param(IS_TIMER_ALL_PERIPH(TIMERx));
    assert_param(IS_TIMER_CHANNEL_NUMBER(Channel));
    assert_param(IS_TIMER_CHANNEL_OUTN_MODE(Mode));

    TmpPtrCH_CNTRL1 = &TIMERx->CH1_CNTRL1 + (uint32_t)Channel;

    TmpRegCH_CNTRL1 = *TmpPtrCH_CNTRL1;
    TmpRegCH_CNTRL1 &= ~TIMER_CH_CNTRL1_NSELOE_Msk;
    TmpRegCH_CNTRL1 |= (uint32_t)Mode;
    *TmpPtrCH_CNTRL1 = TmpRegCH_CNTRL1;
}

/**
 * @brief  Configures the TIMERx Channel Negative Output polarity.
 * @param  TIMERx: select the TIMER peripheral.
 *         This parameter can be one of the following values: MDR_TIMER0, MDR_TIMER1.
 * @param  Channel - @ref TIMER_CH_Number_TypeDef - specifies the Timer Channel number.
 * @param  Polarity - @ref TIMER_CH_OUTN_Polarity_TypeDef - enables or disables the Channel Negative Output inversion.
 * @retval None.
 */
void TIMER_CH_OUTN_PolarityConfig(MDR_TIMER_TypeDef* TIMERx, TIMER_CH_Number_TypeDef Channel, TIMER_CH_OUTN_Polarity_TypeDef Polarity)
{
    __IO uint32_t* TmpPtrCH_CNTRL1;
    uint32_t       TmpRegCH_CNTRL1;

    /* Check the parameters */
    assert_param(IS_TIMER_ALL_PERIPH(TIMERx));
    assert_param(IS_TIMER_CHANNEL_NUMBER(Channel));
    assert_param(IS_TIMER_CHANNEL_OUTN_POLARITY(Polarity));

    TmpPtrCH_CNTRL1 = &TIMERx->CH1_CNTRL1 + (uint32_t)Channel;

    TmpRegCH_CNTRL1 = *TmpPtrCH_CNTRL1;
    TmpRegCH_CNTRL1 &= ~TIMER_CH_CNTRL1_NINV_Msk;
    TmpRegCH_CNTRL1 |= (uint32_t)Polarity;
    *TmpPtrCH_CNTRL1 = TmpRegCH_CNTRL1;
}

/**
 * @brief  Checks whether the specified TIMERx Status flag is set or not.
 * @param  TIMERx: select the TIMER peripheral.
 *         This parameter can be one of the following values: MDR_TIMER0, MDR_TIMER1.
 * @param  Flag - @ref TIMER_Flags_TypeDef - specifies the flag to check.
 * @retval @ref FlagStatus - Current Status flag state (SET or RESET).
 */
FlagStatus TIMER_GetFlagStatus(MDR_TIMER_TypeDef* TIMERx, TIMER_Flags_TypeDef Flag)
{
    FlagStatus Status;

    /* Check the parameters */
    assert_param(IS_TIMER_ALL_PERIPH(TIMERx));
    assert_param(IS_TIMER_FLAG(Flag));

    if (TIMERx->STATUS & (uint32_t)Flag) {
        Status = SET;
    } else {
        Status = RESET;
    }

