piborisovich/microcontrollers/Milandr/Libraries/SPL/MDR32F2xQI/src/MDR32F2xQI_timer.c
    return Status;
}

/**
 * @brief  Returns the TIMERx Status Register value.
 * @param  TIMERx: select the TIMER peripheral.
 *         This parameter can be one of the following values: MDR_TIMER0, MDR_TIMER1.
 * @retval The TIMER Status Flags combined value.
 */
uint32_t TIMER_GetStatus(MDR_TIMER_TypeDef* TIMERx)
{
    /* Check the parameter */
    assert_param(IS_TIMER_ALL_PERIPH(TIMERx));

    return (TIMERx->STATUS);
}

/**
 * @brief  Clears the TIMERx's Status Flags.
 * @param  TIMERx: select the TIMER peripheral.
 *         This parameter can be one of the following values: MDR_TIMER0, MDR_TIMER1.
 * @param  Flags: specifies the flags to clear.
 *         This parameter can be any combination of @ref TIMER_Flags_TypeDef values.
 * @retval None.
 */
void TIMER_ClearFlags(MDR_TIMER_TypeDef* TIMERx, uint32_t Flags)
{
    /* Check the parameters */
    assert_param(IS_TIMER_ALL_PERIPH(TIMERx));
    assert_param(IS_TIMER_FLAGS(Flags));

    TIMERx->STATUS = ~Flags;
}

/**
 * @brief  Enables or disables the TIMER interrupts.
 * @param  TIMERx: select the TIMER peripheral.
 *         This parameter can be one of the following values: MDR_TIMER0, MDR_TIMER1.
 * @param  ITs: specifies the TIMER interrupts sources to be enabled or disabled.
 *         This parameter can be any combination of @ref TIMER_Flags_TypeDef values.
 * @param  NewState - @ref FunctionalState - new state of the TIMER interrupts.
 * @retval None.
 */
void TIMER_ITConfig(MDR_TIMER_TypeDef* TIMERx, uint32_t ITs, FunctionalState NewState)
{
    /* Check the parameters */
    assert_param(IS_TIMER_ALL_PERIPH(TIMERx));
    assert_param(IS_TIMER_FLAGS(ITs));
    assert_param(IS_FUNCTIONAL_STATE(NewState));

    /* Form new value */
    if (NewState != DISABLE) {
        /* Enable the TIMERx Interrupt requests by setting bits in the IE register */
        TIMERx->IE |= ITs;
    } else {
        /* Disable the TIMERx Interrupt requests by clearing bits in the IE register */
        TIMERx->IE &= ~ITs;
    }
}

/**
 * @brief  Checks whether the specified TIMERx interrupt has occurred or not.
 * @param  TIMERx: select the TIMER peripheral.
 *         This parameter can be one of the following values: MDR_TIMER0, MDR_TIMER1.
 * @param  IT - @ref TIMER_Flags_TypeDef - specifies the TIMER interrupt source to check.
 * @retval @ref ITStatus - The state of the IT (SET or RESET).
 */
ITStatus TIMER_GetITFlagStatus(MDR_TIMER_TypeDef* TIMERx, TIMER_Flags_TypeDef IT)
{
    ITStatus Status;

    /* Check the parameters */
    assert_param(IS_TIMER_ALL_PERIPH(TIMERx));
    assert_param(IS_TIMER_FLAG(IT));

    if (TIMERx->STATUS & TIMERx->IE & (uint32_t)IT) {
        Status = SET;
    } else {
        Status = RESET;
    }

    return Status;
}

/**
 * @brief  Checks whether the TIMERx masked interrupts has occurred or not.
 * @param  TIMERx: select the TIMER peripheral.
 *         This parameter can be one of the following values: MDR_TIMER0, MDR_TIMER1.
 * @retval Combined state of currently active interrupt flags.
 *         Returns combined value of @ref TIMER_Flags_TypeDef.
 */
uint32_t TIMER_GetITStatus(MDR_TIMER_TypeDef* TIMERx)
{
    /* Check the parameter */
    assert_param(IS_TIMER_ALL_PERIPH(TIMERx));

    return TIMERx->STATUS & TIMERx->IE;
}

#if defined(USE_MDR32F21QI)
/**
 * @brief  Enables or disables the TIMERx DMA Requests.
 * @param  TIMERx: select the TIMER peripheral.
 *         This parameter can be one of the following values: MDR_TIMER0, MDR_TIMER1.
 * @param  DMAReqs - specifies the DMA Request sources.
 *         This parameter can be any combination of @ref TIMER_Flags_TypeDef values.
 * @param  NewState - @ref FunctionalState - new state of the DMA Request sources.
 * @retval None.
 */
void TIMER_DMACmd(MDR_TIMER_TypeDef* TIMERx, uint32_t DMAReqs, FunctionalState NewState)
{
    /* Check the parameters */
    assert_param(IS_TIMER_ALL_PERIPH(TIMERx));
    assert_param(IS_TIMER_FLAGS(DMAReqs));
    assert_param(IS_FUNCTIONAL_STATE(NewState));

    /* Form new value */
    if (NewState != DISABLE) {
        /* Enable the TIMERx DMA Requests by setting bits in the DMA_RE register */
        TIMERx->DMA_RE |= DMAReqs;
    } else {
        /* Disable the TIMERx DMA Requests by clearing bits in the DMA_RE register */
        TIMERx->DMA_RE &= ~DMAReqs;
    }
}
#endif

/** @} */ /* End of group TIMER_Exported_Functions */

/** @} */ /* End of group TIMER */

/** @} */ /* End of group __MDR32F2xQI_StdPeriph_Driver */

/*********************** (C) COPYRIGHT 2025 Milandr ****************************
 *
 * END OF FILE MDR32F2xQI_timer.c */

